cf_billing/InformationRegisters/энргПодписанты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПодписанты</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоверенности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПодписанта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПодписантов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПодписанты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет схему запроса, для получения данных из РС "Подписанты"
//
// Параметры:
//  Схема				-	СхемаЗапроса	-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура		-	Параметры отбора.
//  ТаблицаДляПомещения	-	Строка			-	Название временной таблицы.
//
Процедура Подписанты(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "Подписанты") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];		
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПодписанты());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
	                              	
	ПараметрПериод 						= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
				
	ВспомогательныеПоля 				= "Период";
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 				= "Организация, Район, ТипМетаданных, ВидПодписанта";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Получает подписантов.
//
// Параметры:
//  Период		-	Дата.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  Имя			-	Строка.
//  МВТ			-	МенеджерВременныхТаблиц.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьПодписантов(Период,Организация,Район,Имя,МВТ = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПодписантыСрезПоследних.Организация КАК Организация,
		|	энргПодписантыСрезПоследних.ВидПодписанта КАК ВидПодписанта,
		|	энргПодписантыСрезПоследних.Сотрудник КАК Сотрудник,
		|	энргПодписантыСрезПоследних.Доверенность КАК Доверенность
		|ПОМЕСТИТЬ Подписанты
		|ИЗ
		|	РегистрСведений.энргПодписанты.СрезПоследних(&Период, Организация = &Организация И Район = &Район) КАК энргПодписантыСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|		ПО энргПодписантыСрезПоследних.ТипМетаданных = ИдентификаторыОбъектовМетаданных.Ссылка
		|ГДЕ
		|	ИдентификаторыОбъектовМетаданных.Имя = &Имя";
	
	Запрос.УстановитьПараметр("Имя", Имя);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("Период", Период);
	
	Если МВТ = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ Подписанты", "");
	Иначе
		Запрос.МенеджерВременныхТаблиц = МВТ;
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаПодписанты()
	
	Текст =
	"ВЫБРАТЬ
	|	энргПодписантыСрезПоследних.Организация КАК Организация,
	|	энргПодписантыСрезПоследних.Район КАК Район,
	|	энргПодписантыСрезПоследних.ТипМетаданных КАК ТипМетаданных,
	|	энргПодписантыСрезПоследних.ВидПодписанта КАК ВидПодписанта,
	|	энргПодписантыСрезПоследних.Сотрудник КАК Сотрудник,
	|	энргПодписантыСрезПоследних.Доверенность КАК Доверенность
	|ИЗ
	|	РегистрСведений.энргПодписанты.СрезПоследних КАК энргПодписантыСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
